{
  "architectures": [
    "Owlv2ForObjectDetection"
  ],
  "dtype": "float32",
  "initializer_factor": 1.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "owlv2",
  "projection_dim": 512,
  "text_config": {
    "attention_dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "quick_gelu",
    "hidden_size": 512,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 16,
    "model_type": "owlv2_text_model",
    "num_attention_heads": 8,
    "num_hidden_layers": 12,
    "vocab_size": 49408
  },
  "transformers_version": "4.57.6",
  "vision_config": {
    "attention_dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "quick_gelu",
    "hidden_size": 768,
    "image_size": 960,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-05,
    "model_type": "owlv2_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16
  }
}
